Model: "sequential_1"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 dense_7 (Dense)             (None, 24)                576       
                                                                 
 dense_8 (Dense)             (None, 58)                1450      
                                                                 
 dropout_5 (Dropout)         (None, 58)                0         
                                                                 
 dense_9 (Dense)             (None, 1)                 59        
                                                                 
=================================================================
Total params: 2,085
Trainable params: 2,085
Non-trainable params: 0
_________________________________________________________________
